#+TITLE: Developer and curator setup guide
#+AUTHOR: Tom Gillespie

THIS IS A WORK IN PROGRESS!

* Variables :noexport:
  #+NAME: repos
  | pyontutils hyputils ontquery parsercomb protc rrid-metadata rkdf orgstrap sparc-curation |
  #+NAME: sci-repos
  | NIF-Ontology scibot |
  #+NAME: other-repos
  | https://github.com/Ophirr33/pda https://github.com/zussitarze/qrcode |
  #+NAME: roots
  | pyontutils hyputils ontquery parsercomb protc/protcur sparc-curation scibot |
  #+NAME: rkt-roots
  | protc/protc-lib protc/protc-tools-lib protc/protc protc/protc-tools rkdf/rkdf-lib rkdf/rkdf rrid-metadata/rrid NIF-Ontology/ qrcode/ pda/ |
  
  #+CAPTION: testing
  #+BEGIN_SRC bash :var REPOS=repos SCIREPOS=sci-repos OREP=other-repos ROOTS=roots RKTROOTS=rkt-roots
    for repo in ${REPOS}; do echo ${repo}; done
    echo '-------------'
    for repo in ${SCIREPOS}; do echo ${repo}; done
    echo '-------------'
    for repo in ${OREP}; do echo ${repo}; done
    echo '-------------'
    for repo in ${ROOTS}; do echo ${repo}; done
    echo '-------------'
    for repo in ${RKTROOTS}; do echo ${repo}; done
  #+END_SRC
  
  #+NAME: user-home-paths
  #+CAPTION: ubuntu struggles to set these correctly via ~/.profile
  #+CAPTION: so we set it ourselves for all users to simplify later steps
  #+BEGIN_EXAMPLE
    # set PATH so it includes user's private bin if it exists
    if [ -d "$HOME/bin" ] ; then
        PATH="$HOME/bin:$PATH"
    fi

    # set PATH so it includes user's private bin if it exists
    if [ -d "$HOME/.local/bin" ] ; then
        PATH="$HOME/.local/bin:$PATH"
    fi
  #+END_EXAMPLE

  #+NAME: remote-exports
  #+CAPTION: export commands to set if running remotely via copy and paste
  #+BEGIN_SRC bash :results output drawer :var UHP=user-home-paths :var REPOS=repos SCIREPOS=sci-repos OREP=other-repos ROOTS=roots RKTROOTS=rkt-roots
    echo export REPOS=\'${REPOS}\'
    echo export SCIREPOS=\'${SCIREPOS}\'
    echo export OREP=\'${OREP}\'
    echo export ROOTS=\'${ROOTS}\'
    echo export RKTROOTS=\'${RKTROOTS}\'
    echo export UHP=$(printf "%q" "${UHP}")
  #+END_SRC

  #+RESULTS: remote-exports
  :results:
  export REPOS='pyontutils hyputils ontquery parsercomb protc rrid-metadata rkdf orgstrap sparc-curation'
  export SCIREPOS='NIF-Ontology scibot'
  export OREP='https://github.com/Ophirr33/pda https://github.com/zussitarze/qrcode'
  export ROOTS='pyontutils hyputils ontquery parsercomb protc/protcur sparc-curation scibot'
  export RKTROOTS='protc/protc-lib protc/protc-tools-lib protc/protc protc/protc-tools rkdf/rkdf-lib rkdf/rkdf rrid-metadata/rrid NIF-Ontology/ qrcode/ pda/'
  export UHP=$'# set PATH so it includes user\'s private bin if it exists\nif [ -d "$HOME/bin" ] ; then\n PATH="$HOME/bin:$PATH"\nfi\n\n# set PATH so it includes user\'s private bin if it exists\nif [ -d "$HOME/.local/bin" ] ; then\n PATH="$HOME/.local/bin:$PATH"\nfi\n'
  :end:

